# -*- coding: utf-8 -*- 
s = open("input.txt").read().decode("utf-8")
fields = [["Номер извещения:", "К"],
          ["Краткое наименование аукциона:", "Дата и время"], 
          ["Дата окончания срока рассмотрения заявок на участие:", "("], 
          ["Дата проведения открытого аукциона:", "("],
          ["Наименование организации:", "ИНН"],
          ["Начальная (максимальная) цена контракта:", ","]
         ]
data = []

#TODO: странная магия с кодировками 
for i in fields:
  l = s.find(i[0].decode('utf-8'))
  r = s.find(i[1].decode('utf-8'), l)
  l+=len(i[0].decode('utf-8'))+1
  data.append(s[l:r])


for i in data:
  print i.encode("utf-8")
print "-------------------"
